---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ReuseLocalPlacement
source: html/85c18673-c186-4313-a063-9658072de7fa.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ReuseLocalPlacement Property

Allows re-use of local placement when creating a new local placement
 due to shifting of breps when moving towards the origin.

## Syntax (C#)
```csharp
public bool ReuseLocalPlacement { get; set; }
```